In [1]:
import pandas as pd
from typing_extensions import runtime
from zmq.backend.cffi.socket import new_pointer_from_opt

In [3]:
# 사전의 key가 열(colum) 이름이 됩니다.
humans01 = pd.DataFrame({
    '이름': ['김철수', '박영희'],
    '직업': ['의사', '변호사'],
    '권역': ['서울', '경기'],
    '연령대': ['청년', '중년'],
    '성별': ['남', '여']
})
print(humans01)

    이름   직업  권역 연령대 성별
0  김철수   의사  서울  청년  남
1  박영희  변호사  경기  중년  여

In [4]:
humans02 = pd.DataFrame({
    '직업': ['의사', '변호사'],
    '권역': ['서울', '경기'],
    '연령대': ['청년', '중년'],
    '성별': ['남', '여']
    }, index = ['김철수', '박영희']
)
print(humans02)

      직업  권역 연령대 성별
김철수   의사  서울  청년  남
박영희  변호사  경기  중년  여

In [6]:
mydata01 = {
    '성별': ['남', '남', '여', '여'],
    '나이': [30, 35, 40, 45],
    '직업': ['의사', '판사', '변호사', '노무사']
}
myindex01 = ['윤흥식', '유민섭', '이선희', '황진숙']
myframe01 = pd.DataFrame(data=mydata01, index=myindex01)
myframe01

    성별  나이   직업
윤흥식  남  30   의사
유민섭  남  35   판사
이선희  여  40  변호사
황진숙  여  45  노무사

In [15]:
print(f'데이터 타입 확인 : {type(myframe01)}')

myframe01.columns.name = '직원들 정보'
print(f'열 색인 확인 : {myframe01.columns}')

데이터 타입 확인 : <class 'pandas.core.frame.DataFrame'>
열 색인 확인 : Index(['성별', '나이', '직업'], dtype='object', name='직원들 정보')

In [16]:
myframe01.index.name = '직원 이름'
print(f'행 색인 확인 : {myframe01.index}')

행 색인 확인 : Index(['윤흥식', '유민섭', '이선희', '황진숙'], dtype='object', name='직원 이름')

In [29]:
print('데이터 프레임 내용 확인')
print(myframe01)

데이터 프레임 내용 확인
직원들 정보 성별  나이   직업
직원 이름
윤흥식     남  30   의사
유민섭     남  35   판사
이선희     여  40  변호사
황진숙     여  45  노무사

In [28]:
print(f'type(myframe01.values) : {type(myframe01.values)}')

type(myframe01.values) : <class 'numpy.ndarray'>

In [27]:
print('# 주의 사항) 판다스에서 문자열은 object라고 표시됩니다.')
print(f'데이터 타입 확인 : {myframe01.dtypes}')

# 주의 사항) 판다스에서 문자열은 object라고 표시됩니다.
데이터 타입 확인 : 직원들 정보
성별    object
나이     int64
직업    object
dtype: object

In [30]:
print('데이터 프레임 전치하기')
myframe01.T

데이터 프레임 전치하기

직원 이름  윤흥식 유민섭  이선희  황진숙
직원들 정보
성별       남   남    여    여
나이      30  35   40   45
직업      의사  판사  변호사  노무사

In [31]:
print('컬럼 재배치하기')
mycolumns = ['직업', '성별', '나이']
newframe = pd.DataFrame(myframe01, index=myindex01, columns=mycolumns)
newframe

컬럼 재배치하기

      직업 성별  나이
윤흥식   의사  남  30
유민섭   판사  남  35
이선희  변호사  여  40
황진숙  노무사  여  45

In [41]:
myindex02 = ['에스프레소', '아메리카노', '마끼야또', '카푸치노', '카페모카']
mycolumns02 = ['컴포즈커피', '스타벅스', '이디야커피', '메가커피', '투썸플레이스']
mylist02 =list(10 * onedata for onedata in range(1, 26))
print(mylist02)

[10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250]

In [37]:
import numpy as np

mydata02 = np.reshape(mylist02, (5, 5)) # 5행 5열로 형상 변경
mydata02

array([[ 10,  20,  30,  40,  50],
       [ 60,  70,  80,  90, 100],
       [110, 120, 130, 140, 150],
       [160, 170, 180, 190, 200],
       [210, 220, 230, 240, 250]])

In [42]:
myframe02 = pd.DataFrame(mydata02, index=myindex02, columns=mycolumns02)
myframe02

       컴포즈커피  스타벅스  이디야커피  메가커피  투썸플레이스
에스프레소     10    20     30    40      50
아메리카노     60    70     80    90     100
마끼야또     110   120    130   140     150
카푸치노     160   170    180   190     200
카페모카     210   220    230   240     250

In [49]:
result02 = myframe02.iloc[1] # 1번째 행 추출
print(result02)
print(f'\n타입 확인 : {type(result02)}')

컴포즈커피      60
스타벅스       70
이디야커피      80
메가커피       90
투썸플레이스    100
Name: 아메리카노, dtype: int64

타입 확인 : <class 'pandas.core.series.Series'>

In [51]:
result02 = myframe02.iloc[[1,3]] # 몇개의 행 추출
print(result02)

print(f'\n타입 확인 : {type(result02)}')

       컴포즈커피  스타벅스  이디야커피  메가커피  투썸플레이스
아메리카노     60    70     80    90     100
카푸치노     160   170    180   190     200

타입 확인 : <class 'pandas.core.frame.DataFrame'>

In [53]:
result02 = myframe02.iloc[0::2] # 짝수행만 행 추출
result02

       컴포즈커피  스타벅스  이디야커피  메가커피  투썸플레이스
에스프레소     10    20     30    40      50
마끼야또     110   120    130   140     150
카페모카     210   220    230   240     250

In [59]:
result02 = myframe02.loc[['카페모카']]
print(f'데이터 타입: {type(result02)}')
result02

데이터 타입: <class 'pandas.core.frame.DataFrame'>

      컴포즈커피  스타벅스  이디야커피  메가커피  투썸플레이스
카페모카    210   220    230   240     250

In [61]:
result02 = myframe02.loc[['마끼야또', '카푸치노']]
result02

      컴포즈커피  스타벅스  이디야커피  메가커피  투썸플레이스
마끼야또    110   120    130   140     150
카푸치노    160   170    180   190     200

In [65]:
myframe02.loc['아메리카노':'카푸치노']

       컴포즈커피  스타벅스  이디야커피  메가커피  투썸플레이스
아메리카노     60    70     80    90     100
마끼야또     110   120    130   140     150
카푸치노     160   170    180   190     200

In [83]:
mytarget02 = np.random.choice(myframe02.index, 3) # replace = false 옵션은 비복원 추출시 사용함
mytarget02

array(['에스프레소', '에스프레소', '아메리카노'], dtype=object)

In [102]:
result02 = myframe02.loc[mytarget02]
result02

       컴포즈커피  스타벅스  이디야커피  메가커피  투썸플레이스
에스프레소     10    20     30    40      50
에스프레소     10    20     30    40      50
아메리카노     60    70     80    90     100

In [103]:
# result02 = myframe02.loc[행, 열]
result02 = myframe02.loc[['마끼야또'], ['메가커피']]
result02

      메가커피
마끼야또   140

In [104]:
# 콤마 : 서로 떨어진 지점의 항목을 가져올 때 사용
result02 = myframe02.loc[['아메리카노','카페모카'], ['스타벅스', '이디야커피']]
result02

       스타벅스  이디야커피
아메리카노    70     80
카페모카    220    230

In [105]:
# 콜론 : 연속적인 범위의 데이터를 가져올 때 사용하되, 대괄호는 1개만 사용
result02 = myframe02.loc['아메리카노':'카페모카', '스타벅스': '이디야커피']
result02

       스타벅스  이디야커피
아메리카노    70     80
마끼야또    120    130
카푸치노    170    180
카페모카    220    230

In [110]:
print('연속 데이터와 떨어진 데이터의 혼합')
result02 = myframe02.loc['아메리카노':'카푸치노', ['컴포즈커피', '이디야커피']]
result02

연속 데이터와 떨어진 데이터의 혼합

       컴포즈커피  이디야커피
아메리카노     60     80
마끼야또     110    130
카푸치노     160    180

In [111]:
# Boolean Indexing : 참과 거짓을 기반으로 참인 데이터만 추출하는 기법
boolTest = [False, True, True, False, True]
pd.DataFrame(boolTest)

       0
0  False
1   True
2   True
3  False
4   True

In [112]:
result02 = myframe02.loc[boolTest]
result02

       컴포즈커피  스타벅스  이디야커피  메가커피  투썸플레이스
아메리카노     60    70     80    90     100
마끼야또     110   120    130   140     150
카페모카     210   220    230   240     250

In [119]:
store, price = '메가커피', 100
print(f'{store} 실적이 {price} 이하인 품목들')
result02 = myframe02.loc[myframe02[store] <= price]
result02

메가커피 실적이 100 이하인 품목들

       컴포즈커피  스타벅스  이디야커피  메가커피  투썸플레이스
에스프레소     10    20     30    40      50
아메리카노     60    70     80    90     100

In [120]:
store, price = '이디야커피', 180
print(f'{store} 실적이 {price} 이하인 품목들')
result02 = myframe02.loc[myframe02[store] <= price]
result02

이디야커피 실적이 180 이하인 품목들

       컴포즈커피  스타벅스  이디야커피  메가커피  투썸플레이스
에스프레소     10    20     30    40      50
아메리카노     60    70     80    90     100
마끼야또     110   120    130   140     150
카푸치노     160   170    180   190     200

In [ ]:
newindex = ['아메리카노', '카페모카', '마끼야또', '바닐라라떼']
result04 = myframe04.reindex